Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: Documentation Generation ?
ja: ドキュメンテーションの生成

source: Viewing License Scan Results
ja: ライセンス スキャンの結果を表示する

source: Benefits of Ensuring FOSS Compliance
ja: FOSS コンプライアンス徹底のメリット

source: Its popularity spawns something dear to the hearts of software developers: jobs.
ja: その需要は、ソフトウェア開発者にとって重要な「雇用」を生み出しています。

source: Some of the most common challenges include:
ja: 最も一般的な問題として、以下のようなものが考えられます。

source: A copy of the license is included as part of the source code package.
ja: このライセンスのコピーは、ソース コード パッケージに含まれています。

source: Open sourcelicensing: Fundamental concepts and comparison of license types
ja: オープン ソース ライセンス: 基本概念とライセンス タイプ

source: The vision of FOSSBazaar is to serve as a gathering place to discuss, explore, share experiences and cooperatively solve issues related to FOSS governance.
ja: FOSSBazaar のビジョンは、FOSS のガバナンスに関する問題について、議論や調査を行ったり、経験を共有したり、協力して問題解決に当たったりする公共の場を提供することです。

source: The Source Server
ja: ソース サーバー

source: In addition, the figures points out the three tools that the Linux Foundation is initiating as open source tools to help companies with their compliance efforts.
ja: またこの図には、企業のコンプライアンス活動を支援するオープン ソース ツールとして The Linux Foundation が開始する 3 つのツールが表示されています。

source: Bill of Material Difference Tool
ja: BoM 比較ツール (Bill of Material Difference Tool)

source: MULTI-SOURCE DEVELOPMENT MODEL
ja: マルチソース開発モデル

source: 23:59 GMT: Preview sent to QA
ja: 23:59 (世界標準時): プレビューを QA に送信

source: This is often referred to as written offer.
ja: 以下は「書面によるオファー (written offer)」とも呼ばれます。

source: Fundamentals of open source licensing and open compliance requirements
ja: オープン ソース ライセンスおよびオープン コンプライアンス要件に関する基礎知識

source: A key element of the program will be new training courses to guide companies in defining and implementing their own compliance processes.
ja: このプログラムの大きな特徴は、各企業が独自のコンプライアンス プロセスを定義および履行できるようフォローするトレーニング コースがある点です。

source: Overview
ja: 概要

source: One-shot Analysis
ja: 単発解析 (one-shot analysis)

source: The appliance contains a fully functional all-in-one build service and can directly be installed on target hardware or run within a virtual machine.
ja: OBS アプライアンスには、完全版のオールインワン ビルド サービスが含まれており、ターゲット ハードウェアに直接インストールしたり、仮想マシンで実行したりすることができます。

source: An Introduction to the MeeGo Build Infrastructure
ja: MeeGo ビルド基盤の紹介

source: Figure 3 illustrates the analysis results of the uploaded example package.
ja: 図 3 は、アップロードされたサンプル パッケージの解析結果を表したものです。

source: Open Compliance Program Self-Assessment Checklist
ja: オープン コンプライアンス プログラム 自己診断チェックリスト

source: Internal communications can take one of several forms:
ja: 社内コミュニケーションには、以下のような種類があります。

source: Automation & Tools Support
ja: 自動化とツール サポート

source: How the information was generated
ja: その情報がどのように生成されたか

source: - Sign off on product release from a compliance perspective
ja: コンプライアンスの観点から見た製品リリースの承認を行う

source: The operation of such a CA would have to be platform- and OS-neutral and would have to adhere to the usual standards of trust and security (presumably by having a controlling board made up of representatives from the various parties), but it would solve a greater part of the driver and OS verification problem because anything signed with an un-revoked KEK traceable back to the CA root key would be automatically trusted by the UEFI firmware for secure boot.
ja: このような認証局の運用は、プラットフォームにも OS にも中立でなければならず、信頼とセキュリティの標準を順守する必要があります (おそらくは、さまざまな組織の代表による管理役員会を持つことによって)。しかし、こうすることによって、ドライバーや OS の検証問題の多くは解決するでしょう。なぜなら、認証局の起点の鍵にまで到達できる、リボークされていない鍵交換鍵で署名された製品は、すべてセキュア ブート可能であることが UEFI ファームウェアにより信頼されるからです。

source: Of course, you can still see the source package licenses if that source is in your repository but you have to look manually.
ja: もちろん、そのソースが自分のリポジトリ内にあれば、ソース パッケージ ライセンスを検索することはできるが、手作業で行わなければならない。

source: The Metadata Database
ja: メタデータ データベース

source: Engineers requesting to use or contribute to FOSS will be requested to submit forms built around templates designed by the Open Source Review Board (OSRB).
ja: FOSS の使用や FOSS への貢献を行おうとする技術者は、オープン ソース調査委員会 (OSRB) によるテンプレートに沿った形式の申請書を提出するよう求められます。

source: After the build has completed successfully it transfers the binary package to the repository server.
ja: ビルドが正常に完了すると、そのバイナリ パッケージをリポジトリ サーバーに転送します。

source: The goal is to ensure that for any specific FOSS, the company knows how this FOSS is being used, in which product(s) it is included, and has a plan in place to meet the license obligations.
ja: この目的は、企業がすべての FOSS に対し、その FOSS を含む製品の中で、それがどのように使用されているかを知り、そのライセンス義務を果たすためのプランを持つことです。

source: After loading the file, the requested scans are automatically queued to perform the requested analysis in the background.
ja: ファイルを読み込んだ後、要求されたスキャンは自動的にキューに入り、バックグラウンドで解析が実行されます。

source: Conducting final post-distribution verifications
ja: 配布後の最終確認を行う

source: Gumstix provides very small OMAP-based boards at reasonable prices.
ja: Gumstix 社は、リーズナブルで非常に小さな OMAP ボードを提供しています。

source: Acknowledgments
ja: 謝辞

source: c)Responsibility for operating the portal is assigned and staffed appropriately.
ja: c) ポータルの管理責任者が割り当てられ、適切な人材が配置されること。

source: These tools are available for download at http://www.linuxfoundation.org/programs/legal/compliance/tools and are described in the following white papers, available for download at the same URL:
ja: これらのツールは、下記のサイトからダウンロードできます。 http://www.linuxfoundation.org/programs/legal/compliance/tools また、同じ URL から入手できる以下のホワイトペーパーで、ツールについて説明しています。

source: An extension to the architecture review is the linkage analysis review that aims to find potentially problematic code combinations at the static and dynamic link level.
ja: アーキテクチャ レビューの延長がリンク解析レビューです。その目的は、問題発生の可能性のあるコードの組み合わせを静的および動的リンクレベルで検出することです。

source: As example of license compatibility, as illustrated at the Free Software Foundation web site (http://www.fsf.org/licensing/
ja: ライセンス両立性の例として、Free Software Foundation の Web サイト (http://www.fsf.org/licensing/licenses) に次のような記述があります。◆◆現在、このページおよび記述は存在しない◆◆

source: The following sections provide a brief discussion of FOSSology, its features and capabilities and shows examples from FOSSology version 1.2.
ja: 次のセクションでは、FOSSology の機能や性能を簡単に説明し、FOSSology バージョン 1.2 を使って例を示します。

source: Companies must keep an open a dialog with the compliance inquiry reporter.
ja: 企業はコンプライアンスに関する質問者と常に率直に対話する必要があります。

source: It’s not just software development managers and lawyers who care about having a standardized approach to software license compliance.
ja: ソフトウェア ライセンス コンプライアンスへの標準的アプローチに関心があるソフトウェア開発マネージャーや法律家だけではありません。

source: These practices satisfy license requirements through concerted and coordinated compliance efforts.
ja: これらの事例は、協調的かつ組織的なコンプライアンス活動によってライセンス要件を満たしています。

source: The frontend connects OBS to clients via its WebUI and API.
ja: フロントエンドは、WebUI と API を介して OBS とクライアントを接続します。

source: The consequences of non-compliance with the licenses of free and open source software
ja: フリー & オープン ソース ソフトウェア ライセンスのコンプライアンス違反が招く結末

source: - Professional and Comprehensive Compliance Training: The Linux Foundation offers hands-on training from compliance experts for individuals and companies responsible for achieving compliance with open source licenses and establishing an open source compliance program, as well as for those who simply want to learn more about compliance.
ja: プロフェッショナルによる包括的なコンプライアンス トレーニング: The Linux Foundation では、オープン ソース ライセンス準拠を履行する必要があり、オープン ソース コンプライアンス プログラムを確立する必要がある人々や企業向けに、あるいはコンプライアンスについて詳しく学習したい方のために、コンプライアンスの専門家による実践的なトレーニングを提供しています。

source: Building Blocks
ja: 要素

source: Failure to publish source code:
ja: ソース コード配布違反:

source: Built Packages together with their metadata for automatic installation, images, etc. can automatically be distributed to download servers.
ja: 自動インストール用のメタデータやイメージなどがまとめてビルドされたパッケージが、自動的にダウンロード サーバーに配布されます。

source: Acknowledge
ja: 確認

source: The Publisher
ja: パブリッシャー

source: Dynamic versus static linking (discussed in the following section)
ja: 動的リンクか、静的リンクか (次のセクションを参照)

source: For application development, the MeeGo OBS allows developers to easily build their software packages utilizing the same infrastructure the MeeGo distributions were built with, validating dependencies and providing binary compliance.
ja: アプリケーション開発に MeeGo OBS を利用すれば、MeeGo ディストリビューションをビルドしたものと同じ基盤を利用し、依存状態を検証し、さらにバイナリ コンプライアンスも提供しながら、ソフトウェア パッケージを簡単にビルドできます。

source: Verification that all FOSS packages destined for distribution have been identified and approved.
ja: 配布予定のすべての FOSS パッケージが識別および承認されていることの検証。

source: The compliance team verifies that source code license obligations have been met by the time a product is considered ready for release.
ja: コンプライアンス チームは、製品のリリース準備が整うまでに、ソース コード ライセンス義務が履行されていることを検証する。

source: d) Supply Chain staff and others who interface with suppliers have been trained in OSS matters and include OSS concerns in their discussions with third party suppliers
ja: d) サプライヤーとやりとりするサプライ チェーン スタッフやその他の担当者は、OSS 問題の教育を受けており、サードパーティ サプライヤーとの議論に OSS の事項を含めている。

source: This required that she understand the open source licenses and pioneer policies with the world wide developers, corporate legal team, senior management, and 3rd party partners to permit software distribution as well as enable code contributions to the community linux, gnu compiler, and U-Boot projects.
ja: そのために、ソフトウェアを配布したり、Linux コミュニティ、GNU コンパイラー、U-Boot プロジェクトへのコード コントリビューションを行ったりし、オープン ソース ライセンスを理解し、さらに世界中の開発者、企業の法務部門、シニア マネージャー、およびサード パーティ パートナーと一緒に、オープン ソース ポリシーを開拓する必要がありました。

source: This paper provides basic discussion on the changing business environment moving to a multi-source development model, the objectives of compliance and the benefits resulting from having a successful compliance program and much more.
ja: マルチソース開発モデルに移行しているビジネス環境、コンプライアンスの目的、優れたコンプライアンス プログラムがもたらすメリットなど、知っておくべき基本情報が含まれています。

source: Satisfying license obligations
ja: ライセンス義務の履行

source: For more information, please visit http://www.linuxfoundation.org or follow the organization on Twitter at http://www.twitter.com/linuxfoundation.
ja: The Linux Foundation の詳細については、http://www.linuxfoundation.org (英語) または http://www.linuxfoundation.jp (日本語) を参照してください。また、ツイッターで http://www.twitter.com/linuxfoundation および http://twitter.com/LinuxJapan をフォローしてください。

source: A practical example:
ja: 実例:

source: 3) OSS Discovery is a free, open source scanning tool that helps enterprises find the open source software included in their internal applications and installed on corporate workstations and servers.
ja: 3) OSS Discovery。このツールは、無償のオープン ソース スキャン ツールです。社内のアプリケーションに組み込まれている OSS や、会社のワークステーションやサーバーにインストールされている OSS を検出するのに便利です。

source: MeeGo has established a 6-months release cadence mounting two releases per year in April and October in addition to maintenance releases in-between.
ja: MeeGo は、リリース間のメンテナンス リリースに加え、4 月と 10 月に 2 つのリリースをマウントするという 6 か月ごとのリリース サイクルを確立しました。

source: Offer a simple but enforced policies and light weight processes (discussed earlier)
ja: シンプルだが強制的なポリシーと軽量なプロセスを提供する (前述)

source: The platform owner, being controller of the PK, would even be able to remove the original operating system KEK, thus ensuring that the platform would only boot the modified operating system.
ja: プラットフォーム鍵の管理者であるプラットフォーム オーナーは、オリジナルの OS の鍵交換鍵を削除することもでき、そうすることで、そのプラットフォームが、変更された OS だけをブートするようにもできます。

source: Dependency Checker includes a license policy framework that enables company FOSS Compliance Officers to define combinations of licenses and linkage methods to be flagged if found during code scans.
ja: この依存状態チェッカーには、ライセンス ポリシー フレームワークが含まれています。企業の FOSS コンプライアンス オフィサーが、ライセンスの組み合わせやリンク方法を定義しておくと、それらがコード スキャン中に発見された場合には警告されます。

source: Inspect and resolve each file or snippet flagged by the scanning tool as matching source code coming from sources other than where you think it came from.
ja: スキャンツールの警告により、当該ソースコードが予想外の開発元で作成されていることがわかった場合、それぞれのファイルやソース コードの断片を調査し、問題を解決します。

source: OBS scales from an all-in-one deployment installed from a ready-to-go appliance for individual developers and small workgroups to a fully distributed and redundant system supporting large organizations.
ja: OBS は、個人開発者や小規模ワークグループ向けの手軽なアプライアンスからインストールしたオールインワン デプロイメントにも、大規模組織をサポートする完全分散冗長システムにも対応可能です。

source: Installation
ja: インストール

source: - Coordinate source code scans and audits
ja: ソース コード スキャンと監査処理を調整する

source: The output of the compile step is a series of files in general statically and/or dynamically linkable libraries, executables, scripts etc.
ja: コンパイル ステップの出力データは、一般的に静的/動的にリンク可能なライブラリ、実行ファイル、スクリプトなどのファイル群です。

source: A 2010 study by the Linux Foundation showed that the market for Linux jobs has grown 80% over five years, with a large percentage of those in embedded Linux.
ja: 2010 年に実施されたThe Linux Foundation の調査によれば、Linux 関連の雇用市場は、この 5 年間で 80% 増大し、中でも組込み Linux が大きな割合を占めています。

source: An OBS deployment can have more than one repository servers that can be distributed across multiple physical systems.
ja: OBS デプロイメントは、複数の物理システムに分散された 1 つ以上のリポジトリサーバーを所有することができます。

source: Feedback provided to the Linux Foundation will be treated confidentially to encourage organizations to share their thoughts on compliance and on the uses they are making of the checklist.
ja: Linux Foundation に提出されたフィードバックは、内部資料として、コンプライアンスや、作成中のチェックリストの利用に関する組織の意見共有に、内部資料として役立てられます。

source: Gaining an increased knowledge of available FOSS solutions
ja: 利用可能な FOSS ソリューションについての知識が深まる

source: The Basics You Must Know
ja: 基本概念

source: Continuously run the dependency tracking tool over the build environment to verify linkages and to flag any issues.
ja: ビルド環境全体に依存状態追跡ツールを実行し、リンク状態を確認し、あらゆる問題を洗い出す。

source: The SPDX Working Group was formed to create a set of data exchange standards for companies to use in disclosing open source packages and applicable licenses when they release software.
ja: SPDX™ ワーキング グループというのは、企業がソフトウェアをリリースする際に、オープン ソース パッケージや適用されるライセンスの公開に使用する一連のデータ交換標準を作成するために開設されたワーキング グループです。

source: FOSSology can be automated through the command line and direct database queries, but most users prefer to use the web user interface.
ja: FOSSology は、コマンドラインやダイレクトなデータベース クエリで自動化できますが、ユーザーの多くは、Web UI の使用を好みます。

source: Learn about the framework for an open source compliance program, including: open source licensing basics, compliance requirements, and the consequences of non-compliance.
ja: オープン ソース ライセンスの基礎知識、コンプライアンスの要件、コンプライアンス違反が招く結末など、オープン ソース コンプライアンス プログラムの枠組みについて学習します。

source: Standardized ?
ja: 標準化されていること

source: OBS will automatically download and install all required components for building including the toolchain in a chroot environment on the user's system.
ja: OBS は、そのユーザーのシステムの chroot 環境のツールチェーンなど、必要なすべてのコンポーネントを自動的にダウンロードおよびインストールします。

source: Releasing IP
ja: IP のリリース

source: Education is an essential building block in a compliance program to ensure that employees have a good understanding of the policies governing the use of FOSS.
ja: 教育は、従業員に FOSS 利用の管理ポリシーを正しく理解させるために必要な、コンプライアンス プログラムの不可欠要素です。

source: Audience should include prospective members of the open source compliance team and open source review board charged with implementing the compliance program.
ja: 対象者は、コンプライアンス プログラムの実行に責任を負うオープン ソース コンプライアンス チームやオープン ソース調査委員会のメンバー候補

source: A policy is a set of rules for the use and management of FOSS in your organization.
ja: ポリシーというのは、組織における FOSS の使用と管理に関する規則です。

source: Resolving Issues Phase
ja: 問題解決フェーズ

source: Executive Review of Open Source Compliance
ja: オープン ソース コンプライアンスのエグゼクティブ レビュー

source: - Include FOSS license information and notices in the product documentation
ja: 製品ドキュメントに FOSS のライセンス情報と告知を含める

source: Conduct periodic source code scans/audits.
ja: 定期的なソース コード スキャン/監査を実行する。

source: Live virtual instructor-led delivery will also be offered.
ja: インストラクターによるライブ バーチャル トレーニングも可能です。

source: PROCESS OF RESPONDING TO INCOMING COMPLIANCE INQUIRIES
ja: コンプライアンス照会への対応プロセス

source: Adding to the urgency of this problem, software packages with more than one version have complex interdependencies.
ja: この問題の緊急性に加えて、複数バージョンを持つソフトウェア パッケージには、複雑な相互依存関係があることも考慮の必要があります。

source: Images can be built in various ways for different target systems and it is the developer's responsibility to specify tools and recipe to create the image.
ja: イメージは、ターゲット システムに合わせてさまざまな方法でビルドでき、イメージを作成するためのツールやレシピを指定するのは、開発者の責任です。

source: One of the challenges facing companies is to keep compliance activities going as the company grows and ships more products using FOSS components.
ja: 企業が直面する課題の 1 つは、企業が成長し、また FOSS コンポーネントを使用した製品を大量に出荷しても、コンプライアンス活動を継続することです。

source: With major players in all those categories already on board we are confident and even more so with the escalated support from the Linux Foundation.
ja: 既にこれらの全カテゴリの主要な組織や人々が参加していたため、私たちには自信がありましたが、The Linux Foundation のさらなる支援を得たことで、より一層自信を持つことができました。

source: Other areas where Corporate Development is involved with compliance are transactions such as spin-offs, joint ventures, strategic alliances and OEM distributor agreements.
ja: 経営企画チームは、会社分割、合弁事業、戦略的提携、および OEM ディストリビューター契約などの業務処理においてもコンプライアンスに関わります。

source: Download Now
ja: ダウンロードする

source: Open source software basics
ja: オープン ソース ソフトウェアの基本知識

source: b) The OSS compliance team reviews the disclosure for accuracy and completeness using whatever tools are available to it.
ja: b) OSS コンプライアンス チームは、利用可能なすべてのツールを用いて、開示の正確性と完全性を調査する。

source: Throughout the paper, we will be looking at what happens in these various phases, what are the inputs and outputs of each phase and how to keep tight control on software usage via the compliance process.
ja: このホワイトペーパーでは、こうした各フェーズで何が行われるか、各フェーズの入力と出力は何か、さらに、ソフトウェアの使用に関する厳格な管理をコンプライアンス プロセスによってどのように保持するか、について見ていきます。

source: Ideally, you can refer back to compliance records for the specific product and software component in question, review it, and verify that the compliance record agrees or disagrees with the inquiry.
ja: できれば、該当する製品およびソフトウェア コンポーネントに関する過去のコンプライアンス記録を調べ、そのコンプライアンス記録と問い合わせ内容が一致するかどうか検証します。

source: - Identification of FOSS
ja: FOSS を識別する

source: In this step, you investigate the reported allegation.
ja: ここでは、報告された申し立てについて調査します。

source: You need to understand the obligations under the applicable license and show how and how soon you will meet the obligations.
ja: あなたは、適用されるライセンスに伴う義務を理解し、その義務をいつまでにどう果たすかを示す必要があります。

source: Historically, software developers would use build scripts to call compilers and linkers.
ja: 通常、ソフトウェア開発者は、ビルド スクリプトを使用してコンパイラーやリンカーを呼び出します。

source: c)OSS training is integrated into the organization's training curriculum and made a part of organizational and personal objectives.
ja: c) OSS トレーニングは、組織のトレーニング カリキュラムに統合され、組織および個人の達成目標の一部とすること。

source: The platform should ship with all the KEKs required to allow validation of the firmware and drivers installed in the signature database (section 27.6.1).
ja: プラットフォームは、ファームウェアとドライバーの認証に必要なすべての鍵交換鍵が署名データベースに入れられた状態で出荷されるべきです (セクション 27.6.1)。

source: Summary
ja: 概要

source: Figure 2 highlights the combinations of incoming source code sources.
ja: 図 2 は、さまざまな開発元を持つソース コードの組み合わせを表しています。

source: Open Interfaces
ja: オープンなインタフェース

source: OSS Discovery is available from:http://www.openlogic.com/products/scanners.php#oss-discovery.
ja: OSS Discovery は、次のページから入手できます。http://www.openlogic.com/products/scanners.php#oss-discovery

source: Users can find the latest distributions and packages for their distribution on http://software.opensuse.org/113/en.
ja: ユーザーは、最新のディストリビューションや、各ディストリビューションに対応するパッケージを http://software.opensuse.org/113/en で入手できます。

source: Only modified objects are built.
ja: 変更されたオブジェクトだけをビルドする。

source: - Track progress of every compliance ticket
ja: すべてのコンプライアンス チケットの進捗を追跡する

source: For more details see <Course Outline>.
ja: 詳細については、<コース概要> を参照してください。

source: Prepare your organization to implement an open source compliance program by learning about the fundamentals of open source development, licensing principles, compliance obligations, and the contributions needed from the various functional groups; such as Executive Management, the Law Department, Supply Chain, Technical Documentation and Configuration Management.
ja: オープン ソース開発、ライセンスの原理、コンプライアンス義務の基礎について学習し、さらに実行管理、法律部門、サプライ チェーン、テクニカル ドキュメンテーション、コンフィギュレーション管理などの機能上のグループによる重要な貢献について学ぶことにより、オープン ソース コンプライアンス プログラムを実装する準備をしてください。

source: Many embedded-related IRC discussions happen on freenode.net.
ja: さまざまな組込み関連の IRC ディスカッションが freenode.net で展開されています。

source: In that role, he is responsible for expanding Black Duck’s reach, image and product breadth by developing partnerships in the multi-source development, legal and open source ecosystem.
ja: 彼は、マルチソース開発、リーガル、およびオープン ソース エコシステムのパートナーシップを発展させることにより、同社の対象領域、イメージ、製品の幅を拡大する責任を負っています。◆◆

source: Community contributions
ja: コミュニティへの貢献

source: - In some cases, specifically when a full platform scan is done, a FOSS component may be scanned before having a proper compliance record.
ja: 場合によっては、フル プラットフォーム スキャンが実行された結果、コンプライアンス記録が作成される前に、FOSS コンポーネントが発見される場合もある。

source: Compliance tools and automation
ja: コンプライアンス ツールと自動化

source: Registration
ja: 登録

source: Late-cycle verification steps are used to assure that all compliance requirements have been met before external distribution occurs.
ja: 後期検証 (Late-cycle verification steps) を実施して、外部に配布される前に、すべてのコンプライアンス要件が満たされるよう保証すること。

source: If you want to provide translations of FOSS license, it is recommended that you label these translations as unofficial.
ja: FOSS ライセンスを翻訳する場合は、それが非公式版の翻訳であることを明記するようお勧めします。

source: Outside and in-house legal costs
ja: 外部および社内の法務関連費用

source: Workers can be monitored by an optional warden process.
ja: オプションのウォードン プロセスで、ワーカーを監視することができます。

source: Since compliance is verified on a product-by-product basis, just because a FOSS package is approved for use in one product does not necessarily mean it will be approved for use in a second product.
ja: コンプライアンスというのは、製品ごとに履行されることが原則であるため、ある製品で FOSS の使用が承認されたからといって、別の製品で承認されるとは限りません。

source: SAMPLE COMPLIANCE DUE-DILIGENCE PROCESS
ja: コンプライアンス精査プロセスの例

source: With a one-shot analysis, you HTTP POST a single file to scan (via the web user interface or your own application).
ja: 単発解析では、スキャン対象である 1 つのファイルを (Web UI やアプリケーションを経由して) HTTP POST します。

source: b)Verification activities are used to assure that corresponding source code for the OSS can be built outside the organization's build environment and that the resultant binaries for the OSS packages match the product binaries.
ja: b) 調査対象の OSS に対応するソース コードを組織のビルド環境以外で構築できること、およびその OSS パッケージの成果物であるバイナリと製品バイナリが一致することを保証するために検証作業を行うこと。

source: Therefore it is recommended to go through the process again if the same component (older version) was approved in the past.
ja: したがって、同じコンポーネント (古いバージョン) が過去に承認されていても、もう一度承認プロセスまでの手続きを踏むことをお勧めします。

source: Automation to ensure efficient program execution
ja: 効果的なプログラムの実行を保証する自動化

source: Lacking a standard for suppliers to use in disclosing open source in their products has hindered manufacturer compliance efforts to date.
ja: 自社製品に含まれるオープン ソースを公開する際に使用する標準がないため、製造業者のコンプライアンス活動はなかなか進みませんでした。

source: This would allow for one (or more) Certificate Authority keys to be placed in the UEFI signature database and would then allow the designated Certificate Authorities to issue both KEKs (and even signing keys that allow the production of KEKs) to third parties that would still validate back to the original CA root of trust.
ja: このようなしくみがあれば、1 つまたは複数の認証局の鍵を UEFI 署名データベースに置き、指定された認証局が鍵交換鍵 (および鍵交換鍵の生成を可能にする署名鍵) をサードパーティに発行し、サードパーティが始めの認証局の信頼の起点を再検証する、ということが可能です。

source: Days
ja: 日間

source: FOSS licenses, obligations and how to ensure obligations are met
ja: FOSS のライセンス、義務、および義務遂行の確認方法

source: $3,000 plus instructor travel expenses (as applicable)
ja: 3,000 米ドル + インストラクター派遣料 (必要に応じて)

source: The goal of the BoM difference checker is to compute the difference between two BoM and produce a list of changes.
ja: BoM 比較ツールの目的は、2 つの BoM (構成表) の差異を検出し、変更箇所一覧を作成することです。
